<a target="_blank" href="https://colab.research.google.com/github/ZHAW-ZAV/TSO-FS25-students/blob/main/01_python_basics/01_03_intro_pandas.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

In [1]:
import sys
import os

IN_COLAB = "google.colab" in sys.modules

file_id_co2 = "1XsuqMub8M3SdP50X1MIwAci-lsYS0X9t"
file_id_countries = "17CMqyq43tBbMJ-TId4TH_GF2KskyIUPP"

if IN_COLAB:
    path_to_co2 = "/content/data/co2_emmissions_by_state_2023.csv"
    os.makedirs(os.path.dirname(path_to_co2), exist_ok=True)
    !gdown "https://drive.google.com/uc?id={file_id_co2}" -O "{path_to_co2}"

    path_to_countries = "/content/data/icao_country.json"
    os.makedirs(os.path.dirname(path_to_countries), exist_ok=True)
    !gdown "https://drive.google.com/uc?id={file_id_countries}" -O "{path_to_countries}"
else:
    import gdown

    url = f"https://drive.google.com/uc?id={file_id_co2}"
    path_to_co2 = "data/co2_emmissions_by_state_2023.csv"
    os.makedirs(os.path.dirname(path_to_co2), exist_ok=True)
    gdown.download(url, path_to_co2, quiet=False)

    url = f"https://drive.google.com/uc?id={file_id_countries}"
    path_to_countries = "data/icao_country.json"
    os.makedirs(os.path.dirname(path_to_countries), exist_ok=True)
    gdown.download(url, path_to_countries, quiet=False)

Downloading...
From: https://drive.google.com/uc?id=1XsuqMub8M3SdP50X1MIwAci-lsYS0X9t
To: /Users/wate/Documents/GitHub/TSO-FS26-students/01_python_basics/data/co2_emmissions_by_state_2023.csv
100%|██████████| 22.3k/22.3k [00:00<00:00, 34.5MB/s]
Downloading...
From: https://drive.google.com/uc?id=17CMqyq43tBbMJ-TId4TH_GF2KskyIUPP
To: /Users/wate/Documents/GitHub/TSO-FS26-students/01_python_basics/data/icao_country.json
100%|██████████| 6.48k/6.48k [00:00<00:00, 13.1MB/s]

The code above loads the data, don't modify.

---------------

***Notebook starts here***

# Introduction to Pandas


## Importing Pandas

In [2]:
import pandas as pd

## Reading Data

In [3]:
# You can read all kinds of files with pandas, not just csv,
# but also excel, json, etc. with pd.read_excel, pd.read_json
co2 = pd.read_csv(path_to_co2)

## Exploring Data

In [ ]:
print(f"The DataFrame has {len(co2)} rows.")
print(f"The columns in the DataFrame are: {co2.columns}")

In [5]:
# Let's take a look at the first few rows
co2.head()

,YEAR,MONTH,STATE_NAME,STATE_CODE,CO2_QTY_TONNES,TF,NOTE
0,2023,1,ALBANIA,LA,18498.33075,1440,False
1,2023,1,ARMENIA,UD,35730.17280,1702,False
2,2023,1,AUSTRIA,LO,178321.12065,11355,False
3,2023,1,BELGIUM,EB,366972.22530,10419,False
4,2023,1,BOSNIA AND HERZEGOVINA,LQ,8112.63100,744,False

In [ ]:
# Let's take a look at the last few rows
co2.tail()

In [ ]:
# data types of the columns
co2.info()

In [ ]:
# Some descriptive statistics
co2.describe()

In [ ]:
# Let's see the unique values in the "STATE_NAME" column
co2["STATE_NAME"].unique()

In [ ]:
# How many unique values are there in the "STATE_NAME" column?
len(co2["STATE_NAME"].unique())

In [ ]:
# How many values are there per "STATE_NAME"?
co2["STATE_NAME"].value_counts()

## Filtering and Slicing Data

In [ ]:
# classical approach
co2_ch = co2[co2["STATE_NAME"] == "SWITZERLAND"]
co2_ch

In [ ]:
# using query()
co2_country = co2.query("STATE_NAME == 'SWITZERLAND'")
co2_country

In [ ]:
# with query, you can use variables and complex expressions
country = "ESTONIA"
co2_country = co2.query("STATE_NAME == @country and MONTH <= 6")
co2_country

In [4]:
# show only the columns we are interested in
#
# note the nested square brackets. The first one is to
# access the columns of the dataframe, e.g. co2["STATE_NAME"].
# The second one creates a list, e.g. ["STATE_NAME", "MONTH", "CO2_QTY_TONNES"].
co2[["STATE_NAME", "MONTH", "CO2_QTY_TONNES"]]

                 STATE_NAME  MONTH  CO2_QTY_TONNES
0                   ALBANIA      1    1.849833e+04
1                   ARMENIA      1    3.573017e+04
2                   AUSTRIA      1    1.783211e+05
3                   BELGIUM      1    3.669722e+05
4    BOSNIA AND HERZEGOVINA      1    8.112631e+03
..                      ...    ...             ...
512                   SPAIN     12    1.311217e+06
513                  SWEDEN     12    1.690412e+05
514             SWITZERLAND     12    4.377819e+05
515                 TÜRKIYE     12    1.340713e+06
516          UNITED KINGDOM     12    2.715303e+06

[517 rows x 3 columns]

## Aggregating and Sorting Data

In [6]:
print(f"Total CO2 emissions: {co2['CO2_QTY_TONNES'].sum()}")
print(f"Mean CO2 emissions: {co2['CO2_QTY_TONNES'].mean()}")

# let's display this neatly
print(f"Total CO2 emissions: {co2['CO2_QTY_TONNES'].sum():.0f}")
print(f"Mean CO2 emissions: {co2['CO2_QTY_TONNES'].mean():.1f}")

Total CO2 emissions: 194888478.06594998
Mean CO2 emissions: 376960.30573684716
Total CO2 emissions: 194888478
Mean CO2 emissions: 376960.3

### Grouping data, single aggregation

In [7]:
# group by country and sum the CO2 emissions

# this is a bit more advanced, let's break it down
# 1. group by country: co2.groupby("STATE_NAME")
# 2. select the column we are interested in: ["CO2_QTY_TONNES"]
# 3. sum the values: .sum()

co2_country = co2.groupby("STATE_NAME")["CO2_QTY_TONNES"].sum()
co2_country

STATE_NAME
ALBANIA                   3.293914e+05
ARMENIA                   4.763148e+05
AUSTRIA                   2.568658e+06
BELGIUM                   4.983545e+06
BOSNIA AND HERZEGOVINA    1.328787e+05
BULGARIA                  7.153200e+05
CANARY ISLANDS            3.564486e+06
CROATIA                   6.234476e+05
CYPRUS                    1.005989e+06
CZECHIA                   1.045479e+06
DENMARK                   2.556152e+06
ESTONIA                   1.882184e+05
FINLAND                   2.085232e+06
FRANCE                    2.040482e+07
GEORGIA                   5.199006e+05
GERMANY                   2.676138e+07
GREECE                    4.631251e+06
HUNGARY                   1.033389e+06
ICELAND                   4.862220e+05
IRELAND                   3.198638e+06
ITALY                     1.362850e+07
KOSOVO                    1.760861e+05
LATVIA                    4.033560e+05
LIECHTENSTEIN             4.914000e-01
LITHUANIA                 3.932189e+05
LUXEMBOURG                1.779039e+06
MALTA                     4.679135e+05
MOLDOVA, REPUBLIC OF      1.816314e+05
MONACO                    2.935863e+02
MONTENEGRO                1.204150e+05
NETHERLANDS               9.873388e+06
NORTH MACEDONIA           1.570689e+05
NORWAY                    2.596338e+06
POLAND                    3.611087e+06
PORTUGAL                  5.411971e+06
ROMANIA                   1.401467e+06
SERBIA                    5.498005e+05
SLOVAKIA                  1.560030e+05
SLOVENIA                  9.050871e+04
SPAIN                     1.722617e+07
SWEDEN                    2.313917e+06
SWITZERLAND               5.188589e+06
TÜRKIYE                   1.832419e+07
UNITED KINGDOM            3.352681e+07
Name: CO2_QTY_TONNES, dtype: float64

In [8]:
# same as above, but sorted
#
# Hint: you can split the code into multiple lines to make it more readable,
#       just wrap the code in parentheses

co2_country = (
    co2.groupby("STATE_NAME")["CO2_QTY_TONNES"].sum().sort_values(ascending=False)
)
co2_country

STATE_NAME
UNITED KINGDOM            3.352681e+07
GERMANY                   2.676138e+07
FRANCE                    2.040482e+07
TÜRKIYE                   1.832419e+07
SPAIN                     1.722617e+07
ITALY                     1.362850e+07
NETHERLANDS               9.873388e+06
PORTUGAL                  5.411971e+06
SWITZERLAND               5.188589e+06
BELGIUM                   4.983545e+06
GREECE                    4.631251e+06
POLAND                    3.611087e+06
CANARY ISLANDS            3.564486e+06
IRELAND                   3.198638e+06
NORWAY                    2.596338e+06
AUSTRIA                   2.568658e+06
DENMARK                   2.556152e+06
SWEDEN                    2.313917e+06
FINLAND                   2.085232e+06
LUXEMBOURG                1.779039e+06
ROMANIA                   1.401467e+06
CZECHIA                   1.045479e+06
HUNGARY                   1.033389e+06
CYPRUS                    1.005989e+06
BULGARIA                  7.153200e+05
CROATIA                   6.234476e+05
SERBIA                    5.498005e+05
GEORGIA                   5.199006e+05
ICELAND                   4.862220e+05
ARMENIA                   4.763148e+05
MALTA                     4.679135e+05
LATVIA                    4.033560e+05
LITHUANIA                 3.932189e+05
ALBANIA                   3.293914e+05
ESTONIA                   1.882184e+05
MOLDOVA, REPUBLIC OF      1.816314e+05
KOSOVO                    1.760861e+05
NORTH MACEDONIA           1.570689e+05
SLOVAKIA                  1.560030e+05
BOSNIA AND HERZEGOVINA    1.328787e+05
MONTENEGRO                1.204150e+05
SLOVENIA                  9.050871e+04
MONACO                    2.935863e+02
LIECHTENSTEIN             4.914000e-01
Name: CO2_QTY_TONNES, dtype: float64

In [ ]:
# How many values are there per "STATE_NAME"?
# We did this already with this:
# co2["STATE_NAME"].value_counts()
#
# An alternative approach is to use groupby and count the number of rows
# in each group. This is done with the size() function.
print(co2.groupby("STATE_NAME").size())

# or with groupby and count()
print(co2.groupby("STATE_NAME")["STATE_NAME"].count())

### Grouping data, multiple aggregations

In [ ]:
# you can also use the .agg() method to apply multiple functions at once
# for example, we want the sum of the total traffic (TF) and the sum and mean of the CO2 emissions
#
# 1. group by country: co2.groupby("STATE_NAME")
# 2. use the .agg() method to apply multiple functions at once
#    it takes a dictionary as an argument, where the keys are the column names
#    and the values are the functions to apply
# 3. sort the values by the sum of the CO2 emissions
co2_country = (
    co2.groupby("STATE_NAME")
    .agg({"TF": "sum", "CO2_QTY_TONNES": ["sum", "mean"]})
    .sort_values(by=("CO2_QTY_TONNES", "sum"), ascending=False)
)
co2_country

## Modifying and Merging DataFrames

In [ ]:
# let's say we want to add a column with the CO2 emissions per movement
# we can do this by dividing the CO2 emissions by the total traffic
co2["CO2_PER_TF"] = co2["CO2_QTY_TONNES"] / co2["TF"]
co2.sort_values("CO2_PER_TF", ascending=False)

In [11]:
# let's say we want to add some more information about the countries from another file
# first, load the file. This time it's a json file, so we use pd.read_json
# countries = pd.read_json(path_to_countries)
countries = pd.read_json("data/icao_country.json")
countries.head()

  icao_country country_code
0           AG           SB
1           AN           NR
2           AT           PG
3           AY           PG
4           BG           GL

***See notes on join in the presentation***

In [12]:
# now we want to add ISO two character country code to our dataframe. Merging two datasets is a common
# operation and is often called a "join" or "merge". For this to work, we need a common column in both
# datasets. In our case, we have the ICAO code in both dataframes. It is the column "STATE_CODE" in
# the co2 dataframe and "icao_country" in the countries dataframe.
# We can use the .merge() method to join the two.
co2_with_countries = co2.merge(
    countries, left_on="STATE_CODE", right_on="icao_country", how="inner"
)
print(
    f"The original dataframe has {len(co2)} rows, the new one has {len(co2_with_countries)}."
)
co2_with_countries.head()

The original dataframe has 517 rows, the new one has 505.

,YEAR,MONTH,STATE_NAME,STATE_CODE,CO2_QTY_TONNES,TF,NOTE,icao_country,country_code
0,2023,1,ALBANIA,LA,18498.33075,1440,False,LA,IR
1,2023,1,ARMENIA,UD,35730.17280,1702,False,UD,AM
2,2023,1,AUSTRIA,LO,178321.12065,11355,False,LO,AT
3,2023,1,BELGIUM,EB,366972.22530,10419,False,EB,BE
4,2023,1,BOSNIA AND HERZEGOVINA,LQ,8112.63100,744,False,LQ,BA

In [13]:
# well, it seems that we have fewer rows in the new dataframe. Let's see which countries are missing.

# get the countries in the co2 dataframe
countries1 = co2["STATE_CODE"].unique()

# get the countries in the merged dataframe
countries2 = co2_with_countries["icao_country"].unique()

# find the countries that are in the co2 dataframe but not in the countries dataframe
# this can easily be done with sets, which are a data type in python
missing_countries = set(countries1) - set(countries2)
missing_countries

# let's see the rows where the country is missing
co2.query("STATE_CODE in @missing_countries")

     YEAR  MONTH STATE_NAME STATE_CODE  CO2_QTY_TONNES  TF   NOTE
27   2023      1     MONACO         LN        10.37610  18  False
70   2023      2     MONACO         LN        12.64095  20  False
113  2023      3     MONACO         LN        18.13455  30  False
156  2023      4     MONACO         LN        25.05825  41  False
199  2023      5     MONACO         LN        32.91120  54  False
242  2023      6     MONACO         LN        31.38030  52  False
286  2023      7     MONACO         LN        39.42855  64  False
329  2023      8     MONACO         LN        42.32340  70  False
372  2023      9     MONACO         LN        34.32240  57  False
415  2023     10     MONACO         LN        21.98700  36  False
458  2023     11     MONACO         LN        13.03470  21  False
501  2023     12     MONACO         LN        11.98890  18  False

In [14]:
# let's try again, this time with a left join
co2_with_countries = co2.merge(
    countries, left_on="STATE_CODE", right_on="icao_country", how="left"
)
print(
    f"The original dataframe has {len(co2)} rows, the new one has {len(co2_with_countries)}."
)
co2_with_countries.head()

The original dataframe has 517 rows, the new one has 517.

,YEAR,MONTH,STATE_NAME,STATE_CODE,CO2_QTY_TONNES,TF,NOTE,icao_country,country_code
0,2023,1,ALBANIA,LA,18498.33075,1440,False,LA,IR
1,2023,1,ARMENIA,UD,35730.17280,1702,False,UD,AM
2,2023,1,AUSTRIA,LO,178321.12065,11355,False,LO,AT
3,2023,1,BELGIUM,EB,366972.22530,10419,False,EB,BE
4,2023,1,BOSNIA AND HERZEGOVINA,LQ,8112.63100,744,False,LQ,BA